# 4. Функція отримає два параметри – цілі числа (жодне не дорівнює нулю, друге не повинно дорівнювати 1). 
#Сформувати вираз у вигляді ax^k, де а буде результатом множення аргументів, а показник степеня – це число, на одиницю менше за другий аргумент. 
#Наприклад, function4(4, 7) має повернути рядок 28x^6.
puts "Введіть два числа"
a = gets.chomp && b = gets.chomp
def func (a,b)
 a = a.to_i
 b = b.to_i
 if  a == 0 or b == 0  or b == 1
 return false 
 end 
 y = (a*b)
 k = (b-1)
 puts "#{y}x^#{k}" 
end 
puts func(a,b)
sleep 3